ErichStyger/mcuoneclipse/Examples/MCUXpresso/i.MX RT1010/MIMXRT1011_Blinky/startup/startup_mimxrt1011.c
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM7
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - MIMXRT1011
    DMA0_IRQHandler,                  // 16: DMA channel 0 transfer complete
    DMA1_IRQHandler,                  // 17: DMA channel 1 transfer complete
    DMA2_IRQHandler,                  // 18: DMA channel 2 transfer complete
    DMA3_IRQHandler,                  // 19: DMA channel 3 transfer complete
    DMA4_IRQHandler,                  // 20: DMA channel 4 transfer complete
    DMA5_IRQHandler,                  // 21: DMA channel 5 transfer complete
    DMA6_IRQHandler,                  // 22: DMA channel 6 transfer complete
    DMA7_IRQHandler,                  // 23: DMA channel 7 transfer complete
    DMA8_IRQHandler,                  // 24: DMA channel 8 transfer complete
    DMA9_IRQHandler,                  // 25: DMA channel 9 transfer complete
    DMA10_IRQHandler,                 // 26: DMA channel 10 transfer complete
    DMA11_IRQHandler,                 // 27: DMA channel 11 transfer complete
    DMA12_IRQHandler,                 // 28: DMA channel 12 transfer complete
    DMA13_IRQHandler,                 // 29: DMA channel 13 transfer complete
    DMA14_IRQHandler,                 // 30: DMA channel 14 transfer complete
    DMA15_IRQHandler,                 // 31: DMA channel 15 transfer complete
    DMA_ERROR_IRQHandler,             // 32: DMA error interrupt channels 0-15
    CTI0_ERROR_IRQHandler,            // 33: CTI trigger outputs
    CTI1_ERROR_IRQHandler,            // 34: CTI trigger outputs
    CORE_IRQHandler,                  // 35: CorePlatform exception IRQ
    LPUART1_IRQHandler,               // 36: LPUART1 TX interrupt and RX interrupt
    LPUART2_IRQHandler,               // 37: LPUART2 TX interrupt and RX interrupt
    LPUART3_IRQHandler,               // 38: LPUART3 TX interrupt and RX interrupt
    LPUART4_IRQHandler,               // 39: LPUART4 TX interrupt and RX interrupt
    PIT_IRQHandler,                   // 40: PIT interrupt
    USB_OTG1_IRQHandler,              // 41: USBO2 USB OTG1
    FLEXSPI_IRQHandler,               // 42: FlexSPI0 interrupt
    FLEXRAM_IRQHandler,               // 43: FlexRAM address out of range Or access hit IRQ
    LPI2C1_IRQHandler,                // 44: LPI2C1 interrupt
    LPI2C2_IRQHandler,                // 45: LPI2C2 interrupt
    GPT1_IRQHandler,                  // 46: GPT1 interrupt
    GPT2_IRQHandler,                  // 47: GPT2 interrupt
    LPSPI1_IRQHandler,                // 48: LPSPI1 single interrupt vector for all sources
    LPSPI2_IRQHandler,                // 49: LPSPI2 single interrupt vector for all sources
    PWM1_0_IRQHandler,                // 50: PWM1 capture 0, compare 0, or reload 0 interrupt
    PWM1_1_IRQHandler,                // 51: PWM1 capture 1, compare 1, or reload 0 interrupt
    PWM1_2_IRQHandler,                // 52: PWM1 capture 2, compare 2, or reload 0 interrupt
    PWM1_3_IRQHandler,                // 53: PWM1 capture 3, compare 3, or reload 0 interrupt
    PWM1_FAULT_IRQHandler,            // 54: PWM1 fault or reload error interrupt
    KPP_IRQHandler,                   // 55: Keypad nterrupt
    SRC_IRQHandler,                   // 56: SRC interrupt
    GPR_IRQ_IRQHandler,               // 57: Used to notify cores on exception condition while boot
    CCM_1_IRQHandler,                 // 58: CCM IRQ1 interrupt
    CCM_2_IRQHandler,                 // 59: CCM IRQ2 interrupt
    EWM_IRQHandler,                   // 60: EWM interrupt
    WDOG2_IRQHandler,                 // 61: WDOG2 interrupt
    SNVS_HP_WRAPPER_IRQHandler,       // 62: SNVS Functional Interrupt
    SNVS_HP_WRAPPER_TZ_IRQHandler,    // 63: SNVS Security Interrupt
    SNVS_LP_WRAPPER_IRQHandler,       // 64: ON-OFF button press shorter than 5 secs (pulse event)
    CSU_IRQHandler,                   // 65: CSU interrupt
    DCP_IRQHandler,                   // 66: Combined DCP channel interrupts(except channel 0) and CRC interrupt
    DCP_VMI_IRQHandler,               // 67: IRQ of DCP channel 0
    Reserved68_IRQHandler,            // 68: Reserved interrupt
    TRNG_IRQHandler,                  // 69: TRNG interrupt
    Reserved70_IRQHandler,            // 70: Reserved interrupt
    Reserved71_IRQHandler,            // 71: Reserved interrupt
    SAI1_IRQHandler,                  // 72: SAI1 interrupt
    RTWDOG_IRQHandler,                // 73: RTWDOG interrupt
    SAI3_RX_IRQHandler,               // 74: SAI3 interrupt
    SAI3_TX_IRQHandler,               // 75: SAI3 interrupt
    SPDIF_IRQHandler,                 // 76: SPDIF interrupt
    PMU_IRQHandler,                   // 77: PMU interrupt
    XBAR1_IRQ_0_1_2_3_IRQHandler,     // 78: XBAR1 interrupt
    TEMP_LOW_HIGH_IRQHandler,         // 79: TEMPMON interrupt
    TEMP_PANIC_IRQHandler,            // 80: TEMPMON interrupt
    USB_PHY_IRQHandler,               // 81: USBPHY (OTG1 UTMI), Interrupt
    GPC_IRQHandler,                   // 82: GPC interrupt
    ADC1_IRQHandler,                  // 83: ADC1 interrupt
    FLEXIO1_IRQHandler,               // 84: FLEXIO1 interrupt
    DCDC_IRQHandler,                  // 85: DCDC interrupt
    GPIO1_Combined_0_15_IRQHandler,   // 86: Combined interrupt indication for GPIO1 signal 0 throughout 15
    GPIO1_Combined_16_31_IRQHandler,  // 87: Combined interrupt indication for GPIO1 signal 16 throughout 31
    GPIO2_Combined_0_15_IRQHandler,   // 88: Combined interrupt indication for GPIO2 signal 0 throughout 15
    GPIO5_Combined_0_15_IRQHandler,   // 89: Combined interrupt indication for GPIO5 signal 0 throughout 15
    WDOG1_IRQHandler,                 // 90: WDOG1 interrupt
    ADC_ETC_IRQ0_IRQHandler,          // 91: ADCETC IRQ0 interrupt
    ADC_ETC_IRQ1_IRQHandler,          // 92: ADCETC IRQ1 interrupt
    ADC_ETC_IRQ2_IRQHandler,          // 93: ADCETC IRQ2 interrupt
    ADC_ETC_IRQ3_IRQHandler,          // 94: ADCETC IRQ3 interrupt
    ADC_ETC_ERROR_IRQ_IRQHandler,     // 95: ADCETC Error IRQ interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    // Disable interrupts
    __asm volatile ("cpsid i");
    __asm volatile ("MSR MSP, %0" : : "r" (&_vStackTop) : );

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();
#else
    // Disable Watchdog
    volatile unsigned int *WDOG1_WCR = (unsigned int *) 0x400B8000;
    *WDOG1_WCR = *WDOG1_WCR & ~(1 << 2);
    volatile unsigned int *WDOG2_WCR = (unsigned int *) 0x400D0000;
    *WDOG2_WCR = *WDOG2_WCR & ~(1 << 2);
    // Write watchdog update key to unlock
    *((volatile unsigned int *)0x400BC004) = 0xD928C520;
    // Set timeout value
    *((volatile unsigned int *)0x400BC008) = 0xFFFF;
    // Now disable watchdog via control register
    volatile unsigned int *RTWDOG_CS = (unsigned int *) 0x400BC000;
    *RTWDOG_CS = (*RTWDOG_CS & ~(1 << 7)) | (1 << 5);

#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

